MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA2A2BD3CFN/mcu.h
typedef struct                         /*!< (@ 0x407EC000) R_TSN Structure                                            */
{
    __IM uint16_t RESERVED[276];

    union
    {
        __IM uint16_t TSCDR;           /*!< (@ 0x00000228) Temperature Sensor Calibration Data Register               */

        struct
        {
            union
            {
                __IM uint8_t TSCDRL;         /*!< (@ 0x00000228) Temperature Sensor Calibration Data Register
                                              *                  L                                                          */

                struct
                {
                    __IM uint8_t TSCDRL : 8; /*!< [7..0] The calibration data stores the lower 8 bits of the convertedvalue. */
                } TSCDRL_b;
            };

            union
            {
                __IM uint8_t TSCDRH;         /*!< (@ 0x00000229) Temperature Sensor Calibration Data Register
                                              *                  H                                                          */

                struct
                {
                    __IM uint8_t TSCDRH : 8; /*!< [7..0] The calibration data stores the higher 8 bits of the
                                              *   convertedvalue.                                                           */
                } TSCDRH_b;
            };
        };
    };
    __IM uint16_t TSCDRR;              /*!< (@ 0x0000022A) Temperature Sensor Calibration Data Register
                                        *                  (Room Temperature)                                         */
} R_TSN_Type;                          /*!< Size = 556 (0x22c)                                                        */

/* =========================================================================================================================== */
/* ================                                           R_WDT                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief Watchdog Timer (R_WDT)
 */

typedef struct                         /*!< (@ 0x40044200) R_WDT Structure                                            */
{
    union
    {
        __IOM uint8_t WDTRR;           /*!< (@ 0x00000000) WDT Refresh Register                                       */

        struct
        {
            __IOM uint8_t WDTRR : 8;   /*!< [7..0] WDTRR is an 8-bit register that refreshes the down-counter
                                        *   of the WDT.                                                               */
        } WDTRR_b;
    };
    __IM uint8_t RESERVED;

    union
    {
        __IOM uint16_t WDTCR;          /*!< (@ 0x00000002) WDT Control Register                                       */

        struct
        {
            __IOM uint16_t TOPS : 2;   /*!< [1..0] Timeout Period Selection                                           */
            uint16_t            : 2;
            __IOM uint16_t CKS  : 4;   /*!< [7..4] Clock Division Ratio Selection                                     */
            __IOM uint16_t RPES : 2;   /*!< [9..8] Window End Position Selection                                      */
            uint16_t            : 2;
            __IOM uint16_t RPSS : 2;   /*!< [13..12] Window Start Position Selection                                  */
            uint16_t            : 2;
        } WDTCR_b;
    };

    union
    {
        __IOM uint16_t WDTSR;           /*!< (@ 0x00000004) WDT Status Register                                        */

        struct
        {
            __IM uint16_t  CNTVAL : 14; /*!< [13..0] Down-Counter Value                                                */
            __IOM uint16_t UNDFF  : 1;  /*!< [14..14] Underflow Flag                                                   */
            __IOM uint16_t REFEF  : 1;  /*!< [15..15] Refresh Error Flag                                               */
        } WDTSR_b;
    };

    union
    {
        __IOM uint8_t WDTRCR;          /*!< (@ 0x00000006) WDT Reset Control Register                                 */

        struct
        {
            uint8_t               : 7;
            __IOM uint8_t RSTIRQS : 1; /*!< [7..7] Reset Interrupt Request Selection                                  */
        } WDTRCR_b;
    };
    __IM uint8_t RESERVED1;

    union
    {
        __IOM uint8_t WDTCSTPR;        /*!< (@ 0x00000008) WDT Count Stop Control Register                            */

        struct
        {
            uint8_t              : 7;
            __IOM uint8_t SLCSTP : 1;  /*!< [7..7] Sleep-Mode Count Stop Control                                      */
        } WDTCSTPR_b;
    };
    __IM uint8_t  RESERVED2;
    __IM uint16_t RESERVED3;
} R_WDT_Type;                          /*!< Size = 12 (0xc)                                                           */

/* =========================================================================================================================== */
/* ================                                          R_AES_B                                          ================ */
/* =========================================================================================================================== */

/**
 * @brief AES Engine (R_AES_B)
 */

typedef struct                         /*!< (@ 0x400D0000) R_AES_B Structure                                          */
{
    union
    {
        __IOM uint16_t AESCNTL;        /*!< (@ 0x00000000) AES Control Register Low-word                              */

        struct
        {
            uint16_t                       : 1;
            __IOM uint16_t KEYSIZE         : 2; /*!< [2..1] Key Length Selection                                               */
            __IOM uint16_t ENCMODE         : 1; /*!< [3..3] Encryption/Decription Selection                                    */
            __IOM uint16_t CIPHER_USE_MODE : 4; /*!< [7..4] Cipher Use Mode                                                    */
            __IOM uint16_t BYTE_ORDER0     : 1; /*!< [8..8] AESIDAT                                                            */
            __IOM uint16_t BYTE_ORDER1     : 1; /*!< [9..9] AESODAT                                                            */
            __IOM uint16_t BYTE_ORDER2     : 1; /*!< [10..10] AESIV                                                            */
            __IOM uint16_t BYTE_ORDER3     : 1; /*!< [11..11] AESKEY                                                           */
            uint16_t                       : 4;
        } AESCNTL_b;
    };

    union
    {
        __IOM uint16_t AESCNTH;        /*!< (@ 0x00000002) AES Control Register High-word                             */

        struct
        {
            uint16_t             : 15;
            __OM uint16_t SW_RST : 1;  /*!< [15..15] AES Circuit Software Reset                                       */
        } AESCNTH_b;
    };

    union
    {
        __IOM uint16_t AESSTSL;              /*!< (@ 0x00000004) AES Status Register Low-word                               */

        struct
        {
            __IM uint16_t FIRST_ODATA : 1;   /*!< [0..0] AES Output Data status display                                     */
            __IM uint16_t ODATA_VALID : 1;   /*!< [1..1] AES Calculation Status                                             */
            uint16_t                  : 3;
            __IM uint16_t BUSY        : 1;   /*!< [5..5] AES Operation Status                                               */
            uint16_t                  : 10;
        } AESSTSL_b;
    };
    __IOM uint16_t AESSTSH;                  /*!< (@ 0x00000006) AES Status Register High-word                              */

    union
    {
        __IOM uint16_t AESSTSCL;             /*!< (@ 0x00000008) AES Status Clear Register Low-word                         */

        struct
        {
            __OM uint16_t FIRST_ODATA_C : 1; /*!< [0..0] Clear state of first_odata bit in AESSTSL Register                 */
            __OM uint16_t ODATA_VALID_C : 1; /*!< [1..1] Clear odata_valid bit state in AESSTSL Register                    */
            uint16_t                    : 14;
        } AESSTSCL_b;
    };

    union
    {
        __IOM uint16_t AESSTSCH;       /*!< (@ 0x0000000A) AES Status Clear Register High-word                        */

        struct
        {
            uint16_t                : 1;
            __IOM uint16_t CCM_CNTR : 1; /*!< [1..1] CCM Mode control                                                   */
            uint16_t                : 14;
        } AESSTSCH_b;
    };

    union
    {
        __IOM uint16_t AESDCNTL;          /*!< (@ 0x0000000C) AES Data Control Register Low-word                         */

        struct
        {
            __IOM uint16_t AES_START : 1; /*!< [0..0] AES calculation data Output permission                             */
            __IOM uint16_t ODATA_RDY : 1; /*!< [1..1] AES calculation data Output permission                             */
            __IOM uint16_t FIRST     : 1; /*!< [2..2] First block contents control                                       */
            __IOM uint16_t NEWKEY    : 1; /*!< [3..3] Key update                                                         */
            __IOM uint16_t LAST      : 1; /*!< [4..4] Bit to assign whether Input Data is last block Data                */
            __IOM uint16_t ATTR      : 3; /*!< [7..5] Input Data property                                                */
            __IOM uint16_t REM       : 7; /*!< [14..8] Last block effective bit number                                   */
            uint16_t                 : 1;
        } AESDCNTL_b;
    };

    union
    {
        __IOM uint16_t AESDCNTH;       /*!< (@ 0x0000000E) AES Data Control Register High-word                        */

        struct
        {
            uint16_t                : 1;
            __IOM uint16_t CCN_CNTR : 1; /*!< [1..1] CCM Mode control                                                   */
            uint16_t                : 14;
        } AESDCNTH_b;
    };
    __IOM R_AES_B_AESIDAT_Type AESIDAT0; /*!< (@ 0x00000010) AES Input Data Register n                                  */
    __IOM R_AES_B_AESIDAT_Type AESIDAT1; /*!< (@ 0x00000014) AES Input Data Register n                                  */
    __IOM R_AES_B_AESIDAT_Type AESIDAT2; /*!< (@ 0x00000018) AES Input Data Register n                                  */
    __IOM R_AES_B_AESIDAT_Type AESIDAT3; /*!< (@ 0x0000001C) AES Input Data Register n                                  */
    __IM R_AES_B_AESODAT_Type  AESODAT0; /*!< (@ 0x00000020) AES Output Data Register n                                 */
    __IM R_AES_B_AESODAT_Type  AESODAT1; /*!< (@ 0x00000024) AES Output Data Register n                                 */
    __IM R_AES_B_AESODAT_Type  AESODAT2; /*!< (@ 0x00000028) AES Output Data Register n                                 */
    __IM R_AES_B_AESODAT_Type  AESODAT3; /*!< (@ 0x0000002C) AES Output Data Register n                                 */
    __IOM R_AES_B_AESKEY_Type  AESKEY0;  /*!< (@ 0x00000030) AES Key Register n                                         */
    __IOM R_AES_B_AESKEY_Type  AESKEY1;  /*!< (@ 0x00000034) AES Key Register n                                         */
    __IOM R_AES_B_AESKEY_Type  AESKEY2;  /*!< (@ 0x00000038) AES Key Register n                                         */
    __IOM R_AES_B_AESKEY_Type  AESKEY3;  /*!< (@ 0x0000003C) AES Key Register n                                         */
    __IOM R_AES_B_AESKEY_Type  AESKEY4;  /*!< (@ 0x00000040) AES Key Register n                                         */
    __IOM R_AES_B_AESKEY_Type  AESKEY5;  /*!< (@ 0x00000044) AES Key Register n                                         */
    __IOM R_AES_B_AESKEY_Type  AESKEY6;  /*!< (@ 0x00000048) AES Key Register n                                         */
    __IOM R_AES_B_AESKEY_Type  AESKEY7;  /*!< (@ 0x0000004C) AES Key Register n                                         */
    __IOM R_AES_B_AESIV_Type   AESIV0;   /*!< (@ 0x00000050) AES Initialization Vector Register n                       */
    __IOM R_AES_B_AESIV_Type   AESIV1;   /*!< (@ 0x00000054) AES Initialization Vector Register n                       */
    __IOM R_AES_B_AESIV_Type   AESIV2;   /*!< (@ 0x00000058) AES Initialization Vector Register n                       */
    __IOM R_AES_B_AESIV_Type   AESIV3;   /*!< (@ 0x0000005C) AES Initialization Vector Register n                       */
} R_AES_B_Type;                          /*!< Size = 96 (0x60)                                                          */

/* =========================================================================================================================== */
/* ================                                          R_AGTX0                                          ================ */
/* =========================================================================================================================== */

/**
 * @brief Asynchronous General Purpose Timer (R_AGTX0)
 */

typedef struct                          /*!< (@ 0x40084000) R_AGTX0 Structure                                          */
{
    union
    {
        __IOM R_AGTX0_AGT32_Type AGT32; /*!< (@ 0x00000000) AGTW (32-bit) peripheral registers                         */
        __IOM R_AGTX0_AGT16_Type AGT16; /*!< (@ 0x00000000) AGT (16-bit) peripheral registers                          */
    };
} R_AGTX0_Type;                         /*!< Size = 20 (0x14)                                                          */

/* =========================================================================================================================== */
/* ================                                          R_IRTC                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief Realtime Clock with Independent Power Supply (R_IRTC)
 */

