MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA2A2BD3CFN/mcu.h
        struct
        {
            __IOM uint32_t DIS0   : 1; /*!< [0..0] HPF bypass for channel n Type 1 output                             */
            __IOM uint32_t DIS1   : 1; /*!< [1..1] HPF bypass for channel n Type 1 output                             */
            __IOM uint32_t DIS2   : 1; /*!< [2..2] HPF bypass for channel n Type 1 output                             */
            __IOM uint32_t DIS3   : 1; /*!< [3..3] HPF bypass for channel n Type 1 output                             */
            __IOM uint32_t DIS4   : 1; /*!< [4..4] HPF bypass for channel n Type 1 output                             */
            __IOM uint32_t DIS5   : 1; /*!< [5..5] HPF bypass for channel n Type 1 output                             */
            __IOM uint32_t DIS6   : 1; /*!< [6..6] HPF bypass for channel n Type 1 output                             */
            uint32_t              : 9;
            __IOM uint32_t DIS0T2 : 1; /*!< [16..16] HPF bypass for channel n Type 2 output                           */
            __IOM uint32_t DIS1T2 : 1; /*!< [17..17] HPF bypass for channel n Type 2 output                           */
            __IOM uint32_t DIS2T2 : 1; /*!< [18..18] HPF bypass for channel n Type 2 output                           */
            __IOM uint32_t DIS3T2 : 1; /*!< [19..19] HPF bypass for channel n Type 2 output                           */
            uint32_t              : 8;
            __IOM uint32_t COF    : 2; /*!< [29..28] Cut-off frequency of HPF                                         */
            uint32_t              : 2;
        } SDADHPFCR_b;
    };
    __IM uint32_t RESERVED6;

    union
    {
        __IOM uint8_t SDADICR;         /*!< (@ 0x00000020) Sigma-Delta A/D Interrupt Control Register                 */

        struct
        {
            __IOM uint8_t ZCCTL0 : 1;  /*!< [0..0] Detection channel for zero-cross detection 0                       */
            __IOM uint8_t ZCMD0  : 1;  /*!< [1..1] Interrupt output mode for zero-cross detection 0                   */
            __IOM uint8_t ZCEGN0 : 1;  /*!< [2..2] Falling edge detection enable for zero-cross detection
                                        *   0                                                                         */
            __IOM uint8_t ZCEGP0 : 1;  /*!< [3..3] Rising edge detection enable for zero-cross detection
                                        *   0                                                                         */
            __IOM uint8_t ZCCTL1 : 1;  /*!< [4..4] Detection channel for zero-cross detection 1                       */
            __IOM uint8_t ZCMD1  : 1;  /*!< [5..5] Interrupt output mode for zero-cross detection 1                   */
            __IOM uint8_t ZCEGN1 : 1;  /*!< [6..6] Falling edge detection enable for zero-cross detection
                                        *   1                                                                         */
            __IOM uint8_t ZCEGP1 : 1;  /*!< [7..7] Rising edge detection enable for zero-cross detection
                                        *   1                                                                         */
        } SDADICR_b;
    };
    __IM uint8_t  RESERVED7;
    __IM uint16_t RESERVED8;

    union
    {
        __IOM uint8_t SDADICLR;        /*!< (@ 0x00000024) Sigma-Delta A/D Interrupt Clear Register                   */

        struct
        {
            __IOM uint8_t ICL0 : 1;    /*!< [0..0] Zero-cross detection interrupt 0 clear                             */
            uint8_t            : 3;
            __IOM uint8_t ICL1 : 1;    /*!< [4..4] Zero-cross detection interrupt 1 clear                             */
            uint8_t            : 3;
        } SDADICLR_b;
    };
    __IM uint8_t  RESERVED9;
    __IM uint16_t RESERVED10;

    union
    {
        __IOM uint8_t SDADISR;         /*!< (@ 0x00000028) Sigma-Delta A/D Interrupt Status Register                  */

        struct
        {
            __IOM uint8_t ZCI0 : 1;    /*!< [0..0] Zero-cross detection interrupt status for zero-cross
                                        *   detection 0                                                               */
            __IOM uint8_t ZC0  : 1;    /*!< [1..1] DF output status for zero-cross detection 0                        */
            uint8_t            : 2;
            __IOM uint8_t ZCI1 : 1;    /*!< [4..4] Zero-cross detection interrupt status for zero-cross
                                        *   detection 1                                                               */
            __IOM uint8_t ZC1 : 1;     /*!< [5..5] DF output status for zero-cross detection 1                        */
            uint8_t           : 2;
        } SDADISR_b;
    };
    __IM uint8_t  RESERVED11;
    __IM uint16_t RESERVED12;
    __IM uint32_t RESERVED13[5];

    union
    {
        __IOM uint16_t SDADPHCR0;      /*!< (@ 0x00000040) Sigma-Delta A/D Clock Control Register                     */

        struct
        {
            __IOM uint16_t PH : 11;    /*!< [10..0] Phase adjustment for channel n                                    */
            uint16_t          : 5;
        } SDADPHCR0_b;
    };
    __IM uint16_t RESERVED14;

    union
    {
        __IOM uint16_t SDADPHCR1;      /*!< (@ 0x00000044) Sigma-Delta A/D Clock Control Register                     */

        struct
        {
            __IOM uint16_t PH : 11;    /*!< [10..0] Phase adjustment for channel n                                    */
            uint16_t          : 5;
        } SDADPHCR1_b;
    };
    __IM uint16_t RESERVED15;

    union
    {
        __IOM uint16_t SDADPHCR2;      /*!< (@ 0x00000048) Sigma-Delta A/D Clock Control Register                     */

        struct
        {
            __IOM uint16_t PH : 11;    /*!< [10..0] Phase adjustment for channel n                                    */
            uint16_t          : 5;
        } SDADPHCR2_b;
    };
    __IM uint16_t RESERVED16;

    union
    {
        __IOM uint16_t SDADPHCR3;      /*!< (@ 0x0000004C) Sigma-Delta A/D Clock Control Register                     */

        struct
        {
            __IOM uint16_t PH : 11;    /*!< [10..0] Phase adjustment for channel n                                    */
            uint16_t          : 5;
        } SDADPHCR3_b;
    };
    __IM uint16_t RESERVED17;

    union
    {
        __IOM uint16_t SDADPHCR4;      /*!< (@ 0x00000050) Sigma-Delta A/D Clock Control Register                     */

        struct
        {
            __IOM uint16_t PH : 11;    /*!< [10..0] Phase adjustment for channel n                                    */
            uint16_t          : 5;
        } SDADPHCR4_b;
    };
    __IM uint16_t RESERVED18;

    union
    {
        __IOM uint16_t SDADPHCR5;      /*!< (@ 0x00000054) Sigma-Delta A/D Clock Control Register                     */

        struct
        {
            __IOM uint16_t PH : 11;    /*!< [10..0] Phase adjustment for channel n                                    */
            uint16_t          : 5;
        } SDADPHCR5_b;
    };
    __IM uint16_t RESERVED19;

    union
    {
        __IOM uint16_t SDADPHCR6;      /*!< (@ 0x00000058) Sigma-Delta A/D Clock Control Register                     */

        struct
        {
            __IOM uint16_t PH : 11;    /*!< [10..0] Phase adjustment for channel n                                    */
            uint16_t          : 5;
        } SDADPHCR6_b;
    };
    __IM uint16_t RESERVED20;

    union
    {
        __IOM uint16_t SDADPHCR7;      /*!< (@ 0x0000005C) Sigma-Delta A/D Clock Control Register                     */

        struct
        {
            __IOM uint16_t PH : 11;    /*!< [10..0] Phase adjustment for channel n                                    */
            uint16_t          : 5;
        } SDADPHCR7_b;
    };
    __IM uint16_t RESERVED21;
    __IM uint32_t RESERVED22[8];
    __IM uint32_t SDADCR0;             /*!< (@ 0x00000080) Sigma-Delta A/D Conversion Result Register n
                                        *                  Type 1                                                     */
    __IM uint32_t SDADCR1;             /*!< (@ 0x00000084) Sigma-Delta A/D Conversion Result Register n
                                        *                  Type 1                                                     */
    __IM uint32_t SDADCR2;             /*!< (@ 0x00000088) Sigma-Delta A/D Conversion Result Register n
                                        *                  Type 1                                                     */
    __IM uint32_t SDADCR3;             /*!< (@ 0x0000008C) Sigma-Delta A/D Conversion Result Register n
                                        *                  Type 1                                                     */
    __IM uint32_t SDADCR4;             /*!< (@ 0x00000090) Sigma-Delta A/D Conversion Result Register n
                                        *                  Type 1                                                     */
    __IM uint32_t SDADCR5;             /*!< (@ 0x00000094) Sigma-Delta A/D Conversion Result Register n
                                        *                  Type 1                                                     */
    __IM uint32_t SDADCR6;             /*!< (@ 0x00000098) Sigma-Delta A/D Conversion Result Register n
                                        *                  Type 1                                                     */
    __IM uint32_t RESERVED23;
    __IM uint32_t SDADCR0T2;           /*!< (@ 0x000000A0) Sigma-Delta A/D Conversion Result Register n
                                        *                  Type 2                                                     */
    __IM uint32_t SDADCR1T2;           /*!< (@ 0x000000A4) Sigma-Delta A/D Conversion Result Register n
                                        *                  Type 2                                                     */
    __IM uint32_t SDADCR2T2;           /*!< (@ 0x000000A8) Sigma-Delta A/D Conversion Result Register n
                                        *                  Type 2                                                     */
    __IM uint32_t SDADCR3T2;           /*!< (@ 0x000000AC) Sigma-Delta A/D Conversion Result Register n
                                        *                  Type 2                                                     */
    __IM uint32_t RESERVED24[4];
    __IM uint32_t SDADCRLPF0;          /*!< (@ 0x000000C0) Sigma-Delta A/D Conversion Result Register (LPF)
                                        *                  n Type 1                                                   */
    __IM uint32_t SDADCRLPF1;          /*!< (@ 0x000000C4) Sigma-Delta A/D Conversion Result Register (LPF)
                                        *                  n Type 1                                                   */
    __IM uint32_t SDADCRLPF2;          /*!< (@ 0x000000C8) Sigma-Delta A/D Conversion Result Register (LPF)
                                        *                  n Type 1                                                   */
    __IM uint32_t SDADCRLPF3;          /*!< (@ 0x000000CC) Sigma-Delta A/D Conversion Result Register (LPF)
                                        *                  n Type 1                                                   */
    __IM uint32_t SDADCRLPF4;          /*!< (@ 0x000000D0) Sigma-Delta A/D Conversion Result Register (LPF)
                                        *                  n Type 1                                                   */
    __IM uint32_t SDADCRLPF5;          /*!< (@ 0x000000D4) Sigma-Delta A/D Conversion Result Register (LPF)
                                        *                  n Type 1                                                   */
    __IM uint32_t SDADCRLPF6;          /*!< (@ 0x000000D8) Sigma-Delta A/D Conversion Result Register (LPF)
                                        *                  n Type 1                                                   */
    __IM uint32_t RESERVED25;
    __IM uint32_t SDADCRLPF0T2;        /*!< (@ 0x000000E0) Sigma-Delta A/D Conversion Result Register (LPF)
                                        *                  n Type 2                                                   */
    __IM uint32_t SDADCRLPF1T2;        /*!< (@ 0x000000E4) Sigma-Delta A/D Conversion Result Register (LPF)
                                        *                  n Type 2                                                   */
    __IM uint32_t SDADCRLPF2T2;        /*!< (@ 0x000000E8) Sigma-Delta A/D Conversion Result Register (LPF)
                                        *                  n Type 2                                                   */
    __IM uint32_t SDADCRLPF3T2;        /*!< (@ 0x000000EC) Sigma-Delta A/D Conversion Result Register (LPF)
                                        *                  n Type 2                                                   */
} R_SDADC_B_Type;                      /*!< Size = 240 (0xf0)                                                         */

