MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA2A2BD3CFN/mcu.h
/* =========================================================  BCNT0  ========================================================= */
 #define R_IRTC_CP_BCNT0_BCNT0CP_Pos    (0UL)    /*!< BCNT0CP (Bit 0)                                       */
 #define R_IRTC_CP_BCNT0_BCNT0CP_Msk    (0xffUL) /*!< BCNT0CP (Bitfield-Mask: 0xff)                         */
/* =========================================================  BCNT1  ========================================================= */
 #define R_IRTC_CP_BCNT1_BCNT1CP_Pos    (0UL)    /*!< BCNT1CP (Bit 0)                                       */
 #define R_IRTC_CP_BCNT1_BCNT1CP_Msk    (0xffUL) /*!< BCNT1CP (Bitfield-Mask: 0xff)                         */
/* =========================================================  BCNT2  ========================================================= */
 #define R_IRTC_CP_BCNT2_BCNT2CP_Pos    (0UL)    /*!< BCNT2CP (Bit 0)                                       */
 #define R_IRTC_CP_BCNT2_BCNT2CP_Msk    (0xffUL) /*!< BCNT2CP (Bitfield-Mask: 0xff)                         */
/* =========================================================  BCNT3  ========================================================= */
 #define R_IRTC_CP_BCNT3_BCNT3CP_Pos    (0UL)    /*!< BCNT3CP (Bit 0)                                       */
 #define R_IRTC_CP_BCNT3_BCNT3CP_Msk    (0xffUL) /*!< BCNT3CP (Bitfield-Mask: 0xff)                         */
/* ==========================================================  SEC  ========================================================== */
 #define R_IRTC_CP_SEC_SEC10_Pos        (4UL)    /*!< SEC10 (Bit 4)                                         */
 #define R_IRTC_CP_SEC_SEC10_Msk        (0x70UL) /*!< SEC10 (Bitfield-Mask: 0x07)                           */
 #define R_IRTC_CP_SEC_SEC1_Pos         (0UL)    /*!< SEC1 (Bit 0)                                          */
 #define R_IRTC_CP_SEC_SEC1_Msk         (0xfUL)  /*!< SEC1 (Bitfield-Mask: 0x0f)                            */
/* ==========================================================  MIN  ========================================================== */
 #define R_IRTC_CP_MIN_MIN10_Pos        (4UL)    /*!< MIN10 (Bit 4)                                         */
 #define R_IRTC_CP_MIN_MIN10_Msk        (0x70UL) /*!< MIN10 (Bitfield-Mask: 0x07)                           */
 #define R_IRTC_CP_MIN_MIN1_Pos         (0UL)    /*!< MIN1 (Bit 0)                                          */
 #define R_IRTC_CP_MIN_MIN1_Msk         (0xfUL)  /*!< MIN1 (Bitfield-Mask: 0x0f)                            */
/* ==========================================================  HR  =========================================================== */
 #define R_IRTC_CP_HR_PM_Pos            (6UL)    /*!< PM (Bit 6)                                            */
 #define R_IRTC_CP_HR_PM_Msk            (0x40UL) /*!< PM (Bitfield-Mask: 0x01)                              */
 #define R_IRTC_CP_HR_HR10_Pos          (4UL)    /*!< HR10 (Bit 4)                                          */
 #define R_IRTC_CP_HR_HR10_Msk          (0x30UL) /*!< HR10 (Bitfield-Mask: 0x03)                            */
 #define R_IRTC_CP_HR_HR1_Pos           (0UL)    /*!< HR1 (Bit 0)                                           */
 #define R_IRTC_CP_HR_HR1_Msk           (0xfUL)  /*!< HR1 (Bitfield-Mask: 0x0f)                             */
/* ==========================================================  DAY  ========================================================== */
 #define R_IRTC_CP_DAY_DATE10_Pos       (4UL)    /*!< DATE10 (Bit 4)                                        */
 #define R_IRTC_CP_DAY_DATE10_Msk       (0x30UL) /*!< DATE10 (Bitfield-Mask: 0x03)                          */
 #define R_IRTC_CP_DAY_DATE1_Pos        (0UL)    /*!< DATE1 (Bit 0)                                         */
 #define R_IRTC_CP_DAY_DATE1_Msk        (0xfUL)  /*!< DATE1 (Bitfield-Mask: 0x0f)                           */
/* ==========================================================  MON  ========================================================== */
 #define R_IRTC_CP_MON_MON10_Pos        (4UL)    /*!< MON10 (Bit 4)                                         */
 #define R_IRTC_CP_MON_MON10_Msk        (0x10UL) /*!< MON10 (Bitfield-Mask: 0x01)                           */
 #define R_IRTC_CP_MON_MON1_Pos         (0UL)    /*!< MON1 (Bit 0)                                          */
 #define R_IRTC_CP_MON_MON1_Msk         (0xfUL)  /*!< MON1 (Bitfield-Mask: 0x0f)                            */

/* =========================================================================================================================== */
/* ================                                           MULR                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  MULRL  ========================================================= */
/* =========================================================  MULRH  ========================================================= */

/** @} */ /* End of group PosMask_clusters */

/* =========================================================================================================================== */
/* ================                                Pos/Mask Peripheral Section                                ================ */
/* =========================================================================================================================== */

/** @addtogroup PosMask_peripherals
 * @{
 */

/* =========================================================================================================================== */
/* ================                                          R_ADC0                                           ================ */
/* =========================================================================================================================== */

