MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA2A2BD3CFN/mcu.h
/* ========================================================  R64CNT  ========================================================= */
 #define R_IRTC_R64CNT_F1HZ_Pos          (6UL)    /*!< F1HZ (Bit 6)                                          */
 #define R_IRTC_R64CNT_F1HZ_Msk          (0x40UL) /*!< F1HZ (Bitfield-Mask: 0x01)                            */
 #define R_IRTC_R64CNT_F2HZ_Pos          (5UL)    /*!< F2HZ (Bit 5)                                          */
 #define R_IRTC_R64CNT_F2HZ_Msk          (0x20UL) /*!< F2HZ (Bitfield-Mask: 0x01)                            */
 #define R_IRTC_R64CNT_F4HZ_Pos          (4UL)    /*!< F4HZ (Bit 4)                                          */
 #define R_IRTC_R64CNT_F4HZ_Msk          (0x10UL) /*!< F4HZ (Bitfield-Mask: 0x01)                            */
 #define R_IRTC_R64CNT_F8HZ_Pos          (3UL)    /*!< F8HZ (Bit 3)                                          */
 #define R_IRTC_R64CNT_F8HZ_Msk          (0x8UL)  /*!< F8HZ (Bitfield-Mask: 0x01)                            */
 #define R_IRTC_R64CNT_F16HZ_Pos         (2UL)    /*!< F16HZ (Bit 2)                                         */
 #define R_IRTC_R64CNT_F16HZ_Msk         (0x4UL)  /*!< F16HZ (Bitfield-Mask: 0x01)                           */
 #define R_IRTC_R64CNT_F32HZ_Pos         (1UL)    /*!< F32HZ (Bit 1)                                         */
 #define R_IRTC_R64CNT_F32HZ_Msk         (0x2UL)  /*!< F32HZ (Bitfield-Mask: 0x01)                           */
 #define R_IRTC_R64CNT_F64HZ_Pos         (0UL)    /*!< F64HZ (Bit 0)                                         */
 #define R_IRTC_R64CNT_F64HZ_Msk         (0x1UL)  /*!< F64HZ (Bitfield-Mask: 0x01)                           */
/* =======================================================  BCNT0_CNT  ======================================================= */
 #define R_IRTC_BCNT0_CNT_BCNT_Pos       (0UL)    /*!< BCNT (Bit 0)                                          */
 #define R_IRTC_BCNT0_CNT_BCNT_Msk       (0xffUL) /*!< BCNT (Bitfield-Mask: 0xff)                            */
/* =======================================================  BCNT1_CNT  ======================================================= */
 #define R_IRTC_BCNT1_CNT_BCNT_Pos       (0UL)    /*!< BCNT (Bit 0)                                          */
 #define R_IRTC_BCNT1_CNT_BCNT_Msk       (0xffUL) /*!< BCNT (Bitfield-Mask: 0xff)                            */
/* =======================================================  BCNT2_CNT  ======================================================= */
 #define R_IRTC_BCNT2_CNT_BCNT_Pos       (0UL)    /*!< BCNT (Bit 0)                                          */
 #define R_IRTC_BCNT2_CNT_BCNT_Msk       (0xffUL) /*!< BCNT (Bitfield-Mask: 0xff)                            */
/* =======================================================  BCNT3_CNT  ======================================================= */
 #define R_IRTC_BCNT3_CNT_BCNT_Pos       (0UL)    /*!< BCNT (Bit 0)                                          */
 #define R_IRTC_BCNT3_CNT_BCNT_Msk       (0xffUL) /*!< BCNT (Bitfield-Mask: 0xff)                            */
/* ========================================================  RSECCNT  ======================================================== */
 #define R_IRTC_RSECCNT_SEC10_Pos        (4UL)    /*!< SEC10 (Bit 4)                                         */
 #define R_IRTC_RSECCNT_SEC10_Msk        (0x70UL) /*!< SEC10 (Bitfield-Mask: 0x07)                           */
 #define R_IRTC_RSECCNT_SEC1_Pos         (0UL)    /*!< SEC1 (Bit 0)                                          */
 #define R_IRTC_RSECCNT_SEC1_Msk         (0xfUL)  /*!< SEC1 (Bitfield-Mask: 0x0f)                            */
/* ========================================================  RMINCNT  ======================================================== */
 #define R_IRTC_RMINCNT_MIN10_Pos        (4UL)    /*!< MIN10 (Bit 4)                                         */
 #define R_IRTC_RMINCNT_MIN10_Msk        (0x70UL) /*!< MIN10 (Bitfield-Mask: 0x07)                           */
 #define R_IRTC_RMINCNT_MIN1_Pos         (0UL)    /*!< MIN1 (Bit 0)                                          */
 #define R_IRTC_RMINCNT_MIN1_Msk         (0xfUL)  /*!< MIN1 (Bitfield-Mask: 0x0f)                            */
/* ========================================================  RHRCNT  ========================================================= */
 #define R_IRTC_RHRCNT_PM_Pos            (6UL)    /*!< PM (Bit 6)                                            */
 #define R_IRTC_RHRCNT_PM_Msk            (0x40UL) /*!< PM (Bitfield-Mask: 0x01)                              */
 #define R_IRTC_RHRCNT_HR10_Pos          (4UL)    /*!< HR10 (Bit 4)                                          */
 #define R_IRTC_RHRCNT_HR10_Msk          (0x30UL) /*!< HR10 (Bitfield-Mask: 0x03)                            */
 #define R_IRTC_RHRCNT_HR1_Pos           (0UL)    /*!< HR1 (Bit 0)                                           */
 #define R_IRTC_RHRCNT_HR1_Msk           (0xfUL)  /*!< HR1 (Bitfield-Mask: 0x0f)                             */
/* ========================================================  RWKCNT  ========================================================= */
 #define R_IRTC_RWKCNT_DAYW_Pos          (0UL)    /*!< DAYW (Bit 0)                                          */
 #define R_IRTC_RWKCNT_DAYW_Msk          (0x7UL)  /*!< DAYW (Bitfield-Mask: 0x07)                            */
/* ========================================================  RDAYCNT  ======================================================== */
 #define R_IRTC_RDAYCNT_DATE10_Pos       (4UL)    /*!< DATE10 (Bit 4)                                        */
 #define R_IRTC_RDAYCNT_DATE10_Msk       (0x30UL) /*!< DATE10 (Bitfield-Mask: 0x03)                          */
 #define R_IRTC_RDAYCNT_DATE1_Pos        (0UL)    /*!< DATE1 (Bit 0)                                         */
 #define R_IRTC_RDAYCNT_DATE1_Msk        (0xfUL)  /*!< DATE1 (Bitfield-Mask: 0x0f)                           */
/* ========================================================  RMONCNT  ======================================================== */
 #define R_IRTC_RMONCNT_MON10_Pos        (4UL)    /*!< MON10 (Bit 4)                                         */
 #define R_IRTC_RMONCNT_MON10_Msk        (0x10UL) /*!< MON10 (Bitfield-Mask: 0x01)                           */
 #define R_IRTC_RMONCNT_MON1_Pos         (0UL)    /*!< MON1 (Bit 0)                                          */
 #define R_IRTC_RMONCNT_MON1_Msk         (0xfUL)  /*!< MON1 (Bitfield-Mask: 0x0f)                            */
/* ========================================================  RYRCNT  ========================================================= */
 #define R_IRTC_RYRCNT_YR10_Pos          (4UL)    /*!< YR10 (Bit 4)                                          */
 #define R_IRTC_RYRCNT_YR10_Msk          (0xf0UL) /*!< YR10 (Bitfield-Mask: 0x0f)                            */
 #define R_IRTC_RYRCNT_YR1_Pos           (0UL)    /*!< YR1 (Bit 0)                                           */
 #define R_IRTC_RYRCNT_YR1_Msk           (0xfUL)  /*!< YR1 (Bitfield-Mask: 0x0f)                             */
/* =======================================================  BCNT0AR0  ======================================================== */
 #define R_IRTC_BCNT0AR0_BCNTAR_Pos      (0UL)    /*!< BCNTAR (Bit 0)                                        */
 #define R_IRTC_BCNT0AR0_BCNTAR_Msk      (0xffUL) /*!< BCNTAR (Bitfield-Mask: 0xff)                          */
/* =======================================================  BCNT1AR0  ======================================================== */
 #define R_IRTC_BCNT1AR0_BCNTAR_Pos      (0UL)    /*!< BCNTAR (Bit 0)                                        */
 #define R_IRTC_BCNT1AR0_BCNTAR_Msk      (0xffUL) /*!< BCNTAR (Bitfield-Mask: 0xff)                          */
/* =======================================================  BCNT2AR0  ======================================================== */
 #define R_IRTC_BCNT2AR0_BCNTAR_Pos      (0UL)    /*!< BCNTAR (Bit 0)                                        */
 #define R_IRTC_BCNT2AR0_BCNTAR_Msk      (0xffUL) /*!< BCNTAR (Bitfield-Mask: 0xff)                          */
/* =======================================================  BCNT3AR0  ======================================================== */
 #define R_IRTC_BCNT3AR0_BCNTAR_Pos      (0UL)    /*!< BCNTAR (Bit 0)                                        */
 #define R_IRTC_BCNT3AR0_BCNTAR_Msk      (0xffUL) /*!< BCNTAR (Bitfield-Mask: 0xff)                          */
/* =======================================================  BCNT0AER0  ======================================================= */
 #define R_IRTC_BCNT0AER0_ENB_Pos        (0UL)    /*!< ENB (Bit 0)                                           */
 #define R_IRTC_BCNT0AER0_ENB_Msk        (0xffUL) /*!< ENB (Bitfield-Mask: 0xff)                             */
/* =======================================================  BCNT1AER0  ======================================================= */
 #define R_IRTC_BCNT1AER0_ENB_Pos        (0UL)    /*!< ENB (Bit 0)                                           */
 #define R_IRTC_BCNT1AER0_ENB_Msk        (0xffUL) /*!< ENB (Bitfield-Mask: 0xff)                             */
/* =======================================================  BCNT2AER0  ======================================================= */
 #define R_IRTC_BCNT2AER0_ENB_Pos        (0UL)    /*!< ENB (Bit 0)                                           */
 #define R_IRTC_BCNT2AER0_ENB_Msk        (0xffUL) /*!< ENB (Bitfield-Mask: 0xff)                             */
/* =======================================================  BCNT3AER0  ======================================================= */
 #define R_IRTC_BCNT3AER0_ENB_Pos        (0UL)    /*!< ENB (Bit 0)                                           */
 #define R_IRTC_BCNT3AER0_ENB_Msk        (0xffUL) /*!< ENB (Bitfield-Mask: 0xff)                             */
/* ========================================================  RSECAR0  ======================================================== */
 #define R_IRTC_RSECAR0_ENB_Pos          (7UL)    /*!< ENB (Bit 7)                                           */
 #define R_IRTC_RSECAR0_ENB_Msk          (0x80UL) /*!< ENB (Bitfield-Mask: 0x01)                             */
 #define R_IRTC_RSECAR0_SEC10_Pos        (4UL)    /*!< SEC10 (Bit 4)                                         */
 #define R_IRTC_RSECAR0_SEC10_Msk        (0x70UL) /*!< SEC10 (Bitfield-Mask: 0x07)                           */
 #define R_IRTC_RSECAR0_SEC1_Pos         (0UL)    /*!< SEC1 (Bit 0)                                          */
 #define R_IRTC_RSECAR0_SEC1_Msk         (0xfUL)  /*!< SEC1 (Bitfield-Mask: 0x0f)                            */
/* ========================================================  RMINAR0  ======================================================== */
 #define R_IRTC_RMINAR0_ENB_Pos          (7UL)    /*!< ENB (Bit 7)                                           */
 #define R_IRTC_RMINAR0_ENB_Msk          (0x80UL) /*!< ENB (Bitfield-Mask: 0x01)                             */
 #define R_IRTC_RMINAR0_MIN10_Pos        (4UL)    /*!< MIN10 (Bit 4)                                         */
 #define R_IRTC_RMINAR0_MIN10_Msk        (0x70UL) /*!< MIN10 (Bitfield-Mask: 0x07)                           */
 #define R_IRTC_RMINAR0_MIN1_Pos         (0UL)    /*!< MIN1 (Bit 0)                                          */
 #define R_IRTC_RMINAR0_MIN1_Msk         (0xfUL)  /*!< MIN1 (Bitfield-Mask: 0x0f)                            */
/* ========================================================  RHRAR0  ========================================================= */
 #define R_IRTC_RHRAR0_ENB_Pos           (7UL)    /*!< ENB (Bit 7)                                           */
 #define R_IRTC_RHRAR0_ENB_Msk           (0x80UL) /*!< ENB (Bitfield-Mask: 0x01)                             */
 #define R_IRTC_RHRAR0_PM_Pos            (6UL)    /*!< PM (Bit 6)                                            */
 #define R_IRTC_RHRAR0_PM_Msk            (0x40UL) /*!< PM (Bitfield-Mask: 0x01)                              */
 #define R_IRTC_RHRAR0_HR10_Pos          (4UL)    /*!< HR10 (Bit 4)                                          */
 #define R_IRTC_RHRAR0_HR10_Msk          (0x30UL) /*!< HR10 (Bitfield-Mask: 0x03)                            */
 #define R_IRTC_RHRAR0_HR1_Pos           (0UL)    /*!< HR1 (Bit 0)                                           */
 #define R_IRTC_RHRAR0_HR1_Msk           (0xfUL)  /*!< HR1 (Bitfield-Mask: 0x0f)                             */
/* ========================================================  RWKAR0  ========================================================= */
 #define R_IRTC_RWKAR0_ENB_Pos           (7UL)    /*!< ENB (Bit 7)                                           */
 #define R_IRTC_RWKAR0_ENB_Msk           (0x80UL) /*!< ENB (Bitfield-Mask: 0x01)                             */
 #define R_IRTC_RWKAR0_DAYW_Pos          (0UL)    /*!< DAYW (Bit 0)                                          */
 #define R_IRTC_RWKAR0_DAYW_Msk          (0x7UL)  /*!< DAYW (Bitfield-Mask: 0x07)                            */
/* ========================================================  RDAYAR0  ======================================================== */
 #define R_IRTC_RDAYAR0_ENB_Pos          (7UL)    /*!< ENB (Bit 7)                                           */
 #define R_IRTC_RDAYAR0_ENB_Msk          (0x80UL) /*!< ENB (Bitfield-Mask: 0x01)                             */
 #define R_IRTC_RDAYAR0_DATE10_Pos       (4UL)    /*!< DATE10 (Bit 4)                                        */
 #define R_IRTC_RDAYAR0_DATE10_Msk       (0x30UL) /*!< DATE10 (Bitfield-Mask: 0x03)                          */
 #define R_IRTC_RDAYAR0_DATE1_Pos        (0UL)    /*!< DATE1 (Bit 0)                                         */
 #define R_IRTC_RDAYAR0_DATE1_Msk        (0xfUL)  /*!< DATE1 (Bitfield-Mask: 0x0f)                           */
/* ========================================================  RMONAR0  ======================================================== */
 #define R_IRTC_RMONAR0_ENB_Pos          (7UL)    /*!< ENB (Bit 7)                                           */
 #define R_IRTC_RMONAR0_ENB_Msk          (0x80UL) /*!< ENB (Bitfield-Mask: 0x01)                             */
 #define R_IRTC_RMONAR0_MON10_Pos        (4UL)    /*!< MON10 (Bit 4)                                         */
 #define R_IRTC_RMONAR0_MON10_Msk        (0x10UL) /*!< MON10 (Bitfield-Mask: 0x01)                           */
 #define R_IRTC_RMONAR0_MON1_Pos         (0UL)    /*!< MON1 (Bit 0)                                          */
 #define R_IRTC_RMONAR0_MON1_Msk         (0xfUL)  /*!< MON1 (Bitfield-Mask: 0x0f)                            */
/* ========================================================  RYRAR0  ========================================================= */
 #define R_IRTC_RYRAR0_YR10_Pos          (4UL)    /*!< YR10 (Bit 4)                                          */
 #define R_IRTC_RYRAR0_YR10_Msk          (0xf0UL) /*!< YR10 (Bitfield-Mask: 0x0f)                            */
 #define R_IRTC_RYRAR0_YR1_Pos           (0UL)    /*!< YR1 (Bit 0)                                           */
 #define R_IRTC_RYRAR0_YR1_Msk           (0xfUL)  /*!< YR1 (Bitfield-Mask: 0x0f)                             */
/* =======================================================  RYRAREN0  ======================================================== */
 #define R_IRTC_RYRAREN0_ENB_Pos         (7UL)    /*!< ENB (Bit 7)                                           */
 #define R_IRTC_RYRAREN0_ENB_Msk         (0x80UL) /*!< ENB (Bitfield-Mask: 0x01)                             */
/* =========================================================  RCR1  ========================================================== */
 #define R_IRTC_RCR1_PES_Pos             (4UL)    /*!< PES (Bit 4)                                           */
 #define R_IRTC_RCR1_PES_Msk             (0xf0UL) /*!< PES (Bitfield-Mask: 0x0f)                             */
 #define R_IRTC_RCR1_RTCOS_Pos           (3UL)    /*!< RTCOS (Bit 3)                                         */
 #define R_IRTC_RCR1_RTCOS_Msk           (0x8UL)  /*!< RTCOS (Bitfield-Mask: 0x01)                           */
 #define R_IRTC_RCR1_PIE_Pos             (2UL)    /*!< PIE (Bit 2)                                           */
 #define R_IRTC_RCR1_PIE_Msk             (0x4UL)  /*!< PIE (Bitfield-Mask: 0x01)                             */
 #define R_IRTC_RCR1_CIE_Pos             (1UL)    /*!< CIE (Bit 1)                                           */
 #define R_IRTC_RCR1_CIE_Msk             (0x2UL)  /*!< CIE (Bitfield-Mask: 0x01)                             */
 #define R_IRTC_RCR1_AIE_Pos             (0UL)    /*!< AIE (Bit 0)                                           */
 #define R_IRTC_RCR1_AIE_Msk             (0x1UL)  /*!< AIE (Bitfield-Mask: 0x01)                             */
/* =========================================================  RCR2  ========================================================== */
 #define R_IRTC_RCR2_CNTMD_Pos           (7UL)    /*!< CNTMD (Bit 7)                                         */
 #define R_IRTC_RCR2_CNTMD_Msk           (0x80UL) /*!< CNTMD (Bitfield-Mask: 0x01)                           */
 #define R_IRTC_RCR2_HR24_Pos            (6UL)    /*!< HR24 (Bit 6)                                          */
 #define R_IRTC_RCR2_HR24_Msk            (0x40UL) /*!< HR24 (Bitfield-Mask: 0x01)                            */
 #define R_IRTC_RCR2_AADJP_Pos           (5UL)    /*!< AADJP (Bit 5)                                         */
 #define R_IRTC_RCR2_AADJP_Msk           (0x20UL) /*!< AADJP (Bitfield-Mask: 0x01)                           */
 #define R_IRTC_RCR2_AADJE_Pos           (4UL)    /*!< AADJE (Bit 4)                                         */
 #define R_IRTC_RCR2_AADJE_Msk           (0x10UL) /*!< AADJE (Bitfield-Mask: 0x01)                           */
 #define R_IRTC_RCR2_RTCOE_Pos           (3UL)    /*!< RTCOE (Bit 3)                                         */
 #define R_IRTC_RCR2_RTCOE_Msk           (0x8UL)  /*!< RTCOE (Bitfield-Mask: 0x01)                           */
 #define R_IRTC_RCR2_ADJ30_Pos           (2UL)    /*!< ADJ30 (Bit 2)                                         */
 #define R_IRTC_RCR2_ADJ30_Msk           (0x4UL)  /*!< ADJ30 (Bitfield-Mask: 0x01)                           */
 #define R_IRTC_RCR2_RESET_Pos           (1UL)    /*!< RESET (Bit 1)                                         */
 #define R_IRTC_RCR2_RESET_Msk           (0x2UL)  /*!< RESET (Bitfield-Mask: 0x01)                           */
 #define R_IRTC_RCR2_START_Pos           (0UL)    /*!< START (Bit 0)                                         */
 #define R_IRTC_RCR2_START_Msk           (0x1UL)  /*!< START (Bitfield-Mask: 0x01)                           */
/* =========================================================  RCR4  ========================================================== */
 #define R_IRTC_RCR4_ADJ500M_Pos         (0UL)    /*!< ADJ500M (Bit 0)                                       */
 #define R_IRTC_RCR4_ADJ500M_Msk         (0x1UL)  /*!< ADJ500M (Bitfield-Mask: 0x01)                         */
/* =========================================================  RADJ  ========================================================== */
 #define R_IRTC_RADJ_PMADJ_Pos           (6UL)    /*!< PMADJ (Bit 6)                                         */
 #define R_IRTC_RADJ_PMADJ_Msk           (0xc0UL) /*!< PMADJ (Bitfield-Mask: 0x03)                           */
 #define R_IRTC_RADJ_ADJ_Pos             (0UL)    /*!< ADJ (Bit 0)                                           */
 #define R_IRTC_RADJ_ADJ_Msk             (0x3fUL) /*!< ADJ (Bitfield-Mask: 0x3f)                             */
/* =======================================================  BCNT0AR1  ======================================================== */
 #define R_IRTC_BCNT0AR1_BCNTAR_Pos      (0UL)    /*!< BCNTAR (Bit 0)                                        */
 #define R_IRTC_BCNT0AR1_BCNTAR_Msk      (0xffUL) /*!< BCNTAR (Bitfield-Mask: 0xff)                          */
/* =======================================================  BCNT1AR1  ======================================================== */
 #define R_IRTC_BCNT1AR1_BCNTAR_Pos      (0UL)    /*!< BCNTAR (Bit 0)                                        */
 #define R_IRTC_BCNT1AR1_BCNTAR_Msk      (0xffUL) /*!< BCNTAR (Bitfield-Mask: 0xff)                          */
/* =======================================================  BCNT2AR1  ======================================================== */
 #define R_IRTC_BCNT2AR1_BCNTAR_Pos      (0UL)    /*!< BCNTAR (Bit 0)                                        */
 #define R_IRTC_BCNT2AR1_BCNTAR_Msk      (0xffUL) /*!< BCNTAR (Bitfield-Mask: 0xff)                          */
/* =======================================================  BCNT3AR1  ======================================================== */
 #define R_IRTC_BCNT3AR1_BCNTAR_Pos      (0UL)    /*!< BCNTAR (Bit 0)                                        */
 #define R_IRTC_BCNT3AR1_BCNTAR_Msk      (0xffUL) /*!< BCNTAR (Bitfield-Mask: 0xff)                          */
/* =======================================================  BCNT0AER1  ======================================================= */
 #define R_IRTC_BCNT0AER1_ENB_Pos        (0UL)    /*!< ENB (Bit 0)                                           */
 #define R_IRTC_BCNT0AER1_ENB_Msk        (0xffUL) /*!< ENB (Bitfield-Mask: 0xff)                             */
/* =======================================================  BCNT1AER1  ======================================================= */
 #define R_IRTC_BCNT1AER1_ENB_Pos        (0UL)    /*!< ENB (Bit 0)                                           */
 #define R_IRTC_BCNT1AER1_ENB_Msk        (0xffUL) /*!< ENB (Bitfield-Mask: 0xff)                             */
/* =====================================================  BCNT2AER1_AR1  ===================================================== */
 #define R_IRTC_BCNT2AER1_AR1_ENB_Pos    (0UL)    /*!< ENB (Bit 0)                                           */
 #define R_IRTC_BCNT2AER1_AR1_ENB_Msk    (0xffUL) /*!< ENB (Bitfield-Mask: 0xff)                             */
/* =====================================================  BCNT3AER1_AR1  ===================================================== */
 #define R_IRTC_BCNT3AER1_AR1_ENB_Pos    (0UL)    /*!< ENB (Bit 0)                                           */
 #define R_IRTC_BCNT3AER1_AR1_ENB_Msk    (0xffUL) /*!< ENB (Bitfield-Mask: 0xff)                             */
/* ========================================================  RSECAR1  ======================================================== */
 #define R_IRTC_RSECAR1_ENB_Pos          (7UL)    /*!< ENB (Bit 7)                                           */
 #define R_IRTC_RSECAR1_ENB_Msk          (0x80UL) /*!< ENB (Bitfield-Mask: 0x01)                             */
 #define R_IRTC_RSECAR1_SEC10_Pos        (4UL)    /*!< SEC10 (Bit 4)                                         */
 #define R_IRTC_RSECAR1_SEC10_Msk        (0x70UL) /*!< SEC10 (Bitfield-Mask: 0x07)                           */
 #define R_IRTC_RSECAR1_SEC1_Pos         (0UL)    /*!< SEC1 (Bit 0)                                          */
 #define R_IRTC_RSECAR1_SEC1_Msk         (0xfUL)  /*!< SEC1 (Bitfield-Mask: 0x0f)                            */
/* ========================================================  RMINAR1  ======================================================== */
 #define R_IRTC_RMINAR1_ENB_Pos          (7UL)    /*!< ENB (Bit 7)                                           */
 #define R_IRTC_RMINAR1_ENB_Msk          (0x80UL) /*!< ENB (Bitfield-Mask: 0x01)                             */
 #define R_IRTC_RMINAR1_MIN10_Pos        (4UL)    /*!< MIN10 (Bit 4)                                         */
