MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA2A2BD3CFN/mcu.h
 #define R_IRTC_RMINAR1_MIN10_Msk        (0x70UL) /*!< MIN10 (Bitfield-Mask: 0x07)                           */
 #define R_IRTC_RMINAR1_MIN1_Pos         (0UL)    /*!< MIN1 (Bit 0)                                          */
 #define R_IRTC_RMINAR1_MIN1_Msk         (0xfUL)  /*!< MIN1 (Bitfield-Mask: 0x0f)                            */
/* ========================================================  RHRAR1  ========================================================= */
 #define R_IRTC_RHRAR1_ENB_Pos           (7UL)    /*!< ENB (Bit 7)                                           */
 #define R_IRTC_RHRAR1_ENB_Msk           (0x80UL) /*!< ENB (Bitfield-Mask: 0x01)                             */
 #define R_IRTC_RHRAR1_PM_Pos            (6UL)    /*!< PM (Bit 6)                                            */
 #define R_IRTC_RHRAR1_PM_Msk            (0x40UL) /*!< PM (Bitfield-Mask: 0x01)                              */
 #define R_IRTC_RHRAR1_HR10_Pos          (4UL)    /*!< HR10 (Bit 4)                                          */
 #define R_IRTC_RHRAR1_HR10_Msk          (0x30UL) /*!< HR10 (Bitfield-Mask: 0x03)                            */
 #define R_IRTC_RHRAR1_HR1_Pos           (0UL)    /*!< HR1 (Bit 0)                                           */
 #define R_IRTC_RHRAR1_HR1_Msk           (0xfUL)  /*!< HR1 (Bitfield-Mask: 0x0f)                             */
/* ========================================================  RWKAR1  ========================================================= */
 #define R_IRTC_RWKAR1_ENB_Pos           (7UL)    /*!< ENB (Bit 7)                                           */
 #define R_IRTC_RWKAR1_ENB_Msk           (0x80UL) /*!< ENB (Bitfield-Mask: 0x01)                             */
 #define R_IRTC_RWKAR1_DAYW_Pos          (0UL)    /*!< DAYW (Bit 0)                                          */
 #define R_IRTC_RWKAR1_DAYW_Msk          (0x7UL)  /*!< DAYW (Bitfield-Mask: 0x07)                            */
/* ========================================================  RDAYAR1  ======================================================== */
 #define R_IRTC_RDAYAR1_ENB_Pos          (7UL)    /*!< ENB (Bit 7)                                           */
 #define R_IRTC_RDAYAR1_ENB_Msk          (0x80UL) /*!< ENB (Bitfield-Mask: 0x01)                             */
 #define R_IRTC_RDAYAR1_DATE10_Pos       (4UL)    /*!< DATE10 (Bit 4)                                        */
 #define R_IRTC_RDAYAR1_DATE10_Msk       (0x30UL) /*!< DATE10 (Bitfield-Mask: 0x03)                          */
 #define R_IRTC_RDAYAR1_DATE1_Pos        (0UL)    /*!< DATE1 (Bit 0)                                         */
 #define R_IRTC_RDAYAR1_DATE1_Msk        (0xfUL)  /*!< DATE1 (Bitfield-Mask: 0x0f)                           */
/* ========================================================  RMONAR1  ======================================================== */
 #define R_IRTC_RMONAR1_ENB_Pos          (7UL)    /*!< ENB (Bit 7)                                           */
 #define R_IRTC_RMONAR1_ENB_Msk          (0x80UL) /*!< ENB (Bitfield-Mask: 0x01)                             */
 #define R_IRTC_RMONAR1_MON10_Pos        (4UL)    /*!< MON10 (Bit 4)                                         */
 #define R_IRTC_RMONAR1_MON10_Msk        (0x10UL) /*!< MON10 (Bitfield-Mask: 0x01)                           */
 #define R_IRTC_RMONAR1_MON1_Pos         (0UL)    /*!< MON1 (Bit 0)                                          */
 #define R_IRTC_RMONAR1_MON1_Msk         (0xfUL)  /*!< MON1 (Bitfield-Mask: 0x0f)                            */
/* ========================================================  RYRAR1  ========================================================= */
 #define R_IRTC_RYRAR1_YR10_Pos          (4UL)    /*!< YR10 (Bit 4)                                          */
 #define R_IRTC_RYRAR1_YR10_Msk          (0xf0UL) /*!< YR10 (Bitfield-Mask: 0x0f)                            */
 #define R_IRTC_RYRAR1_YR1_Pos           (0UL)    /*!< YR1 (Bit 0)                                           */
 #define R_IRTC_RYRAR1_YR1_Msk           (0xfUL)  /*!< YR1 (Bitfield-Mask: 0x0f)                             */
/* =======================================================  RYRAREN1  ======================================================== */
 #define R_IRTC_RYRAREN1_ENB_Pos         (7UL)    /*!< ENB (Bit 7)                                           */
 #define R_IRTC_RYRAREN1_ENB_Msk         (0x80UL) /*!< ENB (Bitfield-Mask: 0x01)                             */

/* =========================================================================================================================== */
/* ================                                          R_MACL                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  MULB0  ========================================================= */
/* =========================================================  MULB1  ========================================================= */
/* =========================================================  MULB2  ========================================================= */
/* =========================================================  MULB3  ========================================================= */
/* =========================================================  MULB4  ========================================================= */
/* =========================================================  MULB5  ========================================================= */
/* =========================================================  MULB6  ========================================================= */
/* =========================================================  MULB7  ========================================================= */
/* =========================================================  MULB8  ========================================================= */
/* =========================================================  MULB9  ========================================================= */
/* ========================================================  MULB10  ========================================================= */
/* ========================================================  MULB11  ========================================================= */
/* ========================================================  MULB12  ========================================================= */
/* ========================================================  MULB13  ========================================================= */
/* ========================================================  MULB14  ========================================================= */
/* ========================================================  MULB15  ========================================================= */
/* ========================================================  MULB16  ========================================================= */
/* ========================================================  MULB17  ========================================================= */
/* ========================================================  MULB18  ========================================================= */
/* ========================================================  MULB19  ========================================================= */
/* ========================================================  MULB20  ========================================================= */
/* ========================================================  MULB21  ========================================================= */
/* ========================================================  MULB22  ========================================================= */
/* ========================================================  MULB23  ========================================================= */
/* ========================================================  MUL32U  ========================================================= */
/* ========================================================  MUL32S  ========================================================= */
/* ========================================================  MAC32U  ========================================================= */
/* ========================================================  MAC32S  ========================================================= */
/* =========================================================  MULC  ========================================================== */
 #define R_MACL_MULC_MULST_Pos      (0UL)    /*!< MULST (Bit 0)                                         */
 #define R_MACL_MULC_MULST_Msk      (0x1UL)  /*!< MULST (Bitfield-Mask: 0x01)                           */
 #define R_MACL_MULC_MACSF_Pos      (1UL)    /*!< MACSF (Bit 1)                                         */
 #define R_MACL_MULC_MACSF_Msk      (0x2UL)  /*!< MACSF (Bitfield-Mask: 0x01)                           */
 #define R_MACL_MULC_MACOF_Pos      (2UL)    /*!< MACOF (Bit 2)                                         */
 #define R_MACL_MULC_MACOF_Msk      (0x4UL)  /*!< MACOF (Bitfield-Mask: 0x01)                           */
 #define R_MACL_MULC_MULFRAC_Pos    (4UL)    /*!< MULFRAC (Bit 4)                                       */
 #define R_MACL_MULC_MULFRAC_Msk    (0x10UL) /*!< MULFRAC (Bitfield-Mask: 0x01)                         */
 #define R_MACL_MULC_MULSM_Pos      (6UL)    /*!< MULSM (Bit 6)                                         */
 #define R_MACL_MULC_MULSM_Msk      (0x40UL) /*!< MULSM (Bitfield-Mask: 0x01)                           */
 #define R_MACL_MULC_MACMODE_Pos    (7UL)    /*!< MACMODE (Bit 7)                                       */
 #define R_MACL_MULC_MACMODE_Msk    (0x80UL) /*!< MACMODE (Bitfield-Mask: 0x01)                         */
/* ========================================================  MULRCLR  ======================================================== */

/* =========================================================================================================================== */
/* ================                                         R_SDADC_B                                         ================ */
/* =========================================================================================================================== */

