MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA2A2BD3CFN/mcu.h
/* ========================================================  SDADCCR  ======================================================== */
 #define R_SDADC_B_SDADCCR_CK_Pos         (0UL)          /*!< CK (Bit 0)                                            */
 #define R_SDADC_B_SDADCCR_CK_Msk         (0x3UL)        /*!< CK (Bitfield-Mask: 0x03)                              */
/* ========================================================  SDADMR  ========================================================= */
 #define R_SDADC_B_SDADMR_CE_Pos          (0UL)          /*!< CE (Bit 0)                                            */
 #define R_SDADC_B_SDADMR_CE_Msk          (0x1UL)        /*!< CE (Bitfield-Mask: 0x01)                              */
 #define R_SDADC_B_SDADMR_PON_Pos         (16UL)         /*!< PON (Bit 16)                                          */
 #define R_SDADC_B_SDADMR_PON_Msk         (0x10000UL)    /*!< PON (Bitfield-Mask: 0x01)                             */
 #define R_SDADC_B_SDADMR_FR_Pos          (28UL)         /*!< FR (Bit 28)                                           */
 #define R_SDADC_B_SDADMR_FR_Msk          (0x30000000UL) /*!< FR (Bitfield-Mask: 0x03)                              */
 #define R_SDADC_B_SDADMR_TYP_Pos         (30UL)         /*!< TYP (Bit 30)                                          */
 #define R_SDADC_B_SDADMR_TYP_Msk         (0x40000000UL) /*!< TYP (Bitfield-Mask: 0x01)                             */
/* ========================================================  SDADRR  ========================================================= */
 #define R_SDADC_B_SDADRR_RES_Pos         (0UL)          /*!< RES (Bit 0)                                           */
 #define R_SDADC_B_SDADRR_RES_Msk         (0x1UL)        /*!< RES (Bitfield-Mask: 0x01)                             */
/* ========================================================  SDADGCR  ======================================================== */
 #define R_SDADC_B_SDADGCR_GAIN_Pos       (0UL)          /*!< GAIN (Bit 0)                                          */
 #define R_SDADC_B_SDADGCR_GAIN_Msk       (0x7UL)        /*!< GAIN (Bitfield-Mask: 0x07)                            */
/* =======================================================  SDADHPFCR  ======================================================= */
 #define R_SDADC_B_SDADHPFCR_DIS_Pos      (0UL)          /*!< DIS (Bit 0)                                           */
 #define R_SDADC_B_SDADHPFCR_DIS_Msk      (0x1UL)        /*!< DIS (Bitfield-Mask: 0x01)                             */
 #define R_SDADC_B_SDADHPFCR_DIST2_Pos    (16UL)         /*!< DIST2 (Bit 16)                                        */
 #define R_SDADC_B_SDADHPFCR_DIST2_Msk    (0x10000UL)    /*!< DIST2 (Bitfield-Mask: 0x01)                           */
 #define R_SDADC_B_SDADHPFCR_COF_Pos      (28UL)         /*!< COF (Bit 28)                                          */
 #define R_SDADC_B_SDADHPFCR_COF_Msk      (0x30000000UL) /*!< COF (Bitfield-Mask: 0x03)                             */
/* ========================================================  SDADICR  ======================================================== */
 #define R_SDADC_B_SDADICR_ZCCTL0_Pos     (0UL)          /*!< ZCCTL0 (Bit 0)                                        */
 #define R_SDADC_B_SDADICR_ZCCTL0_Msk     (0x1UL)        /*!< ZCCTL0 (Bitfield-Mask: 0x01)                          */
 #define R_SDADC_B_SDADICR_ZCMD0_Pos      (1UL)          /*!< ZCMD0 (Bit 1)                                         */
 #define R_SDADC_B_SDADICR_ZCMD0_Msk      (0x2UL)        /*!< ZCMD0 (Bitfield-Mask: 0x01)                           */
 #define R_SDADC_B_SDADICR_ZCEGN0_Pos     (2UL)          /*!< ZCEGN0 (Bit 2)                                        */
 #define R_SDADC_B_SDADICR_ZCEGN0_Msk     (0x4UL)        /*!< ZCEGN0 (Bitfield-Mask: 0x01)                          */
 #define R_SDADC_B_SDADICR_ZCEGP0_Pos     (3UL)          /*!< ZCEGP0 (Bit 3)                                        */
 #define R_SDADC_B_SDADICR_ZCEGP0_Msk     (0x8UL)        /*!< ZCEGP0 (Bitfield-Mask: 0x01)                          */
 #define R_SDADC_B_SDADICR_ZCCTL1_Pos     (4UL)          /*!< ZCCTL1 (Bit 4)                                        */
 #define R_SDADC_B_SDADICR_ZCCTL1_Msk     (0x10UL)       /*!< ZCCTL1 (Bitfield-Mask: 0x01)                          */
 #define R_SDADC_B_SDADICR_ZCMD1_Pos      (5UL)          /*!< ZCMD1 (Bit 5)                                         */
 #define R_SDADC_B_SDADICR_ZCMD1_Msk      (0x20UL)       /*!< ZCMD1 (Bitfield-Mask: 0x01)                           */
 #define R_SDADC_B_SDADICR_ZCEGN1_Pos     (6UL)          /*!< ZCEGN1 (Bit 6)                                        */
 #define R_SDADC_B_SDADICR_ZCEGN1_Msk     (0x40UL)       /*!< ZCEGN1 (Bitfield-Mask: 0x01)                          */
 #define R_SDADC_B_SDADICR_ZCEGP1_Pos     (7UL)          /*!< ZCEGP1 (Bit 7)                                        */
 #define R_SDADC_B_SDADICR_ZCEGP1_Msk     (0x80UL)       /*!< ZCEGP1 (Bitfield-Mask: 0x01)                          */
/* =======================================================  SDADICLR  ======================================================== */
 #define R_SDADC_B_SDADICLR_ICL0_Pos      (0UL)          /*!< ICL0 (Bit 0)                                          */
 #define R_SDADC_B_SDADICLR_ICL0_Msk      (0x1UL)        /*!< ICL0 (Bitfield-Mask: 0x01)                            */
 #define R_SDADC_B_SDADICLR_ICL1_Pos      (4UL)          /*!< ICL1 (Bit 4)                                          */
 #define R_SDADC_B_SDADICLR_ICL1_Msk      (0x10UL)       /*!< ICL1 (Bitfield-Mask: 0x01)                            */
/* ========================================================  SDADISR  ======================================================== */
 #define R_SDADC_B_SDADISR_ZCI0_Pos       (0UL)          /*!< ZCI0 (Bit 0)                                          */
 #define R_SDADC_B_SDADISR_ZCI0_Msk       (0x1UL)        /*!< ZCI0 (Bitfield-Mask: 0x01)                            */
 #define R_SDADC_B_SDADISR_ZC0_Pos        (1UL)          /*!< ZC0 (Bit 1)                                           */
 #define R_SDADC_B_SDADISR_ZC0_Msk        (0x2UL)        /*!< ZC0 (Bitfield-Mask: 0x01)                             */
 #define R_SDADC_B_SDADISR_ZCI1_Pos       (4UL)          /*!< ZCI1 (Bit 4)                                          */
 #define R_SDADC_B_SDADISR_ZCI1_Msk       (0x10UL)       /*!< ZCI1 (Bitfield-Mask: 0x01)                            */
 #define R_SDADC_B_SDADISR_ZC1_Pos        (5UL)          /*!< ZC1 (Bit 5)                                           */
 #define R_SDADC_B_SDADISR_ZC1_Msk        (0x20UL)       /*!< ZC1 (Bitfield-Mask: 0x01)                             */
/* =======================================================  SDADPHCR0  ======================================================= */
 #define R_SDADC_B_SDADPHCR0_PH_Pos       (0UL)          /*!< PH (Bit 0)                                            */
 #define R_SDADC_B_SDADPHCR0_PH_Msk       (0x7ffUL)      /*!< PH (Bitfield-Mask: 0x7ff)                             */
/* =======================================================  SDADPHCR1  ======================================================= */
 #define R_SDADC_B_SDADPHCR1_PH_Pos       (0UL)          /*!< PH (Bit 0)                                            */
 #define R_SDADC_B_SDADPHCR1_PH_Msk       (0x7ffUL)      /*!< PH (Bitfield-Mask: 0x7ff)                             */
/* =======================================================  SDADPHCR2  ======================================================= */
 #define R_SDADC_B_SDADPHCR2_PH_Pos       (0UL)          /*!< PH (Bit 0)                                            */
 #define R_SDADC_B_SDADPHCR2_PH_Msk       (0x7ffUL)      /*!< PH (Bitfield-Mask: 0x7ff)                             */
/* =======================================================  SDADPHCR3  ======================================================= */
 #define R_SDADC_B_SDADPHCR3_PH_Pos       (0UL)          /*!< PH (Bit 0)                                            */
 #define R_SDADC_B_SDADPHCR3_PH_Msk       (0x7ffUL)      /*!< PH (Bitfield-Mask: 0x7ff)                             */
/* =======================================================  SDADPHCR4  ======================================================= */
 #define R_SDADC_B_SDADPHCR4_PH_Pos       (0UL)          /*!< PH (Bit 0)                                            */
 #define R_SDADC_B_SDADPHCR4_PH_Msk       (0x7ffUL)      /*!< PH (Bitfield-Mask: 0x7ff)                             */
/* =======================================================  SDADPHCR5  ======================================================= */
 #define R_SDADC_B_SDADPHCR5_PH_Pos       (0UL)          /*!< PH (Bit 0)                                            */
 #define R_SDADC_B_SDADPHCR5_PH_Msk       (0x7ffUL)      /*!< PH (Bitfield-Mask: 0x7ff)                             */
/* =======================================================  SDADPHCR6  ======================================================= */
 #define R_SDADC_B_SDADPHCR6_PH_Pos       (0UL)          /*!< PH (Bit 0)                                            */
 #define R_SDADC_B_SDADPHCR6_PH_Msk       (0x7ffUL)      /*!< PH (Bitfield-Mask: 0x7ff)                             */
/* =======================================================  SDADPHCR7  ======================================================= */
 #define R_SDADC_B_SDADPHCR7_PH_Pos       (0UL)          /*!< PH (Bit 0)                                            */
 #define R_SDADC_B_SDADPHCR7_PH_Msk       (0x7ffUL)      /*!< PH (Bitfield-Mask: 0x7ff)                             */
/* ========================================================  SDADCR0  ======================================================== */
/* ========================================================  SDADCR1  ======================================================== */
/* ========================================================  SDADCR2  ======================================================== */
/* ========================================================  SDADCR3  ======================================================== */
/* ========================================================  SDADCR4  ======================================================== */
/* ========================================================  SDADCR5  ======================================================== */
/* ========================================================  SDADCR6  ======================================================== */
/* =======================================================  SDADCR0T2  ======================================================= */
/* =======================================================  SDADCR1T2  ======================================================= */
/* =======================================================  SDADCR2T2  ======================================================= */
/* =======================================================  SDADCR3T2  ======================================================= */
/* ======================================================  SDADCRLPF0  ======================================================= */
/* ======================================================  SDADCRLPF1  ======================================================= */
/* ======================================================  SDADCRLPF2  ======================================================= */
/* ======================================================  SDADCRLPF3  ======================================================= */
/* ======================================================  SDADCRLPF4  ======================================================= */
/* ======================================================  SDADCRLPF5  ======================================================= */
/* ======================================================  SDADCRLPF6  ======================================================= */
/* =====================================================  SDADCRLPF0T2  ====================================================== */
/* =====================================================  SDADCRLPF1T2  ====================================================== */
/* =====================================================  SDADCRLPF2T2  ====================================================== */
/* =====================================================  SDADCRLPF3T2  ====================================================== */

/** @} */ /* End of group PosMask_peripherals */

 #ifdef __cplusplus
}
 #endif

#endif                                 /* R7FA2A2AD_H */

/** @} */ /* End of group R7FA2A2AD */

/** @} */ /* End of group Renesas Electronics Corporation */
